package noclass.info

/**
 * ...
 * @author: Black-skyline (Hu Shujun)
 * @email: 2031649401@qq.com
 * @date: 2023/8/16
 * @Description:
 *
 */
//没课约批量添加开始更新 2023/8/16

//没课约批量添加第二次更新 2023/8/19
/**
 * 没课约批量添加第二次更新，
 * 添加了相关网络请求的接口，
 * 构建了批量添加的基本逻辑，
 * 除了空课表外，其他功能逻辑上基本正常，
 * 但目前遇到的问题是太耗时，待优化
 * 重名学生选择dialog会导致整个手机卡死，暂不知原因
 */
//没课约批量添加第三次更新 2023/8/20
/**
 * 没课约批量添加第三次更新，
 * 修复了批量添加页面里会部分dialog背景显示异常的问题,
 * 修复了重名学生选择dialog会导致整个手机卡死的问题
 */
//没课约批量添加第四次更新 2023/8/21
/**
 * 没课约批量添加第四次更新，
 * 修复了空闲课表无法弹出的问题
 */